#include "Delay.h"

/*********************************************************************
*函  数: void Delay_us(uint32_t xus)
*功  能: 微秒级延时
*参  数: xus 延时时长，范围：0~233015
*返回值: 无
*备  注: 无
*********************************************************************/
void Delay_us(uint32_t xus)
{
	SysTick->LOAD = 100 * xus;				//设置定时器重装值
	SysTick->VAL = 0x00;					//清空当前计数值
	SysTick->CTRL = 0x00000005;				//设置时钟源为HCLK，启动定时器
	while(!(SysTick->CTRL & 0x00010000));	//等待计数到0
	SysTick->CTRL = 0x00000004;				//关闭定时器
}

/*********************************************************************
*函  数: void Delay_ms(uint32_t xms)
*功  能: 毫秒级延时
*参  数: xms 延时时长，范围：0~4294967295
*返回值: 无
*备  注: 无
*********************************************************************/
void Delay_ms(uint32_t xms)
{
	while(xms--)
	{
		Delay_us(1000);
	}
}
 
/*********************************************************************
*函  数: void Delay_s(uint32_t s)
*功  能: 秒级延时
*参  数: xs 延时时长，范围：0~4294967295
*返回值: 无
*备  注: 无
*********************************************************************/
void Delay_s(uint32_t xs)
{
	while(xs--)
	{
		Delay_ms(1000);
	}
}

//static uint32_t fac_us; //微秒系数
//static uint32_t fac_ms; //毫秒系数

///****************************************************************************************************
//*函  数: void Delay_Init(void)
//*功  能: 延时函数初始化
//*参  数: 无
//*返回值：无
//*备  注: T(s) = 1/F(Hz) //赫兹时间转换公式
//****************************************************************************************************/
//void Delay_Init(void)
//{
//	SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);//选择系统时钟（HCLK/8）作为SysTick定时器的时钟
//	SysTick->CTRL = 0x00;
//	fac_us = (SystemCoreClock / 8) / 1000000; //获取微秒系数
//	fac_ms = fac_us * 1000; //获取毫秒系数
//}

///****************************************************************************************************
//*函  数: void delay_ms(uint32_t nTime)
//*功  能: 毫秒级延时
//*参  数: nTime 延时时间
//*返回值：无
//*备  注: SysTick的计数器为24位 nTime最大值为 0xffffff/fac_ms = 1342
//****************************************************************************************************/
//void Delay_ms(uint32_t nTime)
//{
//	uint32_t temp;
//	SysTick->CTRL = 0x00; //失能SysTick定时器
//	SysTick->LOAD = nTime*fac_ms; //计算重装载值
//	SysTick->VAL  = 0x00; //清空计数器
//	SysTick->CTRL|= 0x01; //启动SysTick定时器
//	do
//	{
//		temp=SysTick->CTRL;
//	}
//	while((temp&0x01)&&!(temp&(1<<16))); //循环等待延时结束
//	SysTick->CTRL = 0x00; //失能SysTick定时器
//	SysTick->VAL  = 0x00;//清空计数器
//}

///****************************************************************************************************
//*函  数: void delay_us(uint32_t nTime)
//*功  能: 微妙级延时
//*参  数: nTime 延时时间
//*返回值：无
//*备  注: SysTick的计数器为24位 nTime最大值为 0xffffff/fac_us = 798177
//****************************************************************************************************/
//void Delay_us(uint32_t nTime)
//{
//	uint32_t temp;	
//	SysTick->CTRL = 0x00; //失能SysTick定时器
//	SysTick->LOAD = nTime*fac_us; //计算重装载值
//	SysTick->VAL  = 0x00; //清空计数器
//	SysTick->CTRL|= 0x01; //启动SysTick定时器
//	do
//	{
//		temp=SysTick->CTRL;
//	}
//	while((temp&0x01)&&!(temp&(1<<16))); //循环等待延时结束
//	SysTick->CTRL = 0x00; //失能SysTick定时器
//	SysTick->VAL  = 0x00;//清空计数器(这个必须有否则将会死在while)
//}

