#include <stdlib.h>

#include "Delay.h"

#include "WS2812B.h"

/************************代码移植修改区************************************/

#define WS2812B_CLK 	RCC_APB2Periph_GPIOB // 端口时钟
#define WS2812B_PORT 	GPIOB				 // 端口
#define WS2812B_PIN 	GPIO_Pin_4			 // 引脚

/**************************************************************************/

#define WS2812B_SET1 WS2812B_PORT->BSRR |= WS2812B_PIN
#define WS2812B_SET0 WS2812B_PORT->BRR  |= WS2812B_PIN

/*********************************************************************
 *函  数：void LED_Init(void)
 *功  能：初始化LED控制引脚
 *参  数：无
 *返回值: 无
 *备  注: 无
 *********************************************************************/
void WS2812B_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_APB2PeriphClockCmd(WS2812B_CLK, ENABLE);

	GPIO_InitStructure.GPIO_Pin = WS2812B_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(WS2812B_PORT, &GPIO_InitStructure);
	
	GPIO_ResetBits(WS2812B_PORT, WS2812B_PIN);
}

/***************************************************************************
 *函  数：void WS2812B_Reset(void)
 *功  能：WS2812B灯复位
 *参  数：无
 *返回值：无
 *备  注: 无
 ***************************************************************************/
void WS2812B_Reset(void)
{
	WS2812B_SET0;
	Delay_us(80);
}

/***************************************************************************
 *函  数：void WS2812B_Write0(void)
 *功  能：写0
 *参  数：无
 *返回值：无
 *备  注: 不同的系统时钟频率下需要微调（默认HCLK=100MHz）
 ***************************************************************************/
static void WS2812B_Write0(void)
{
	WS2812B_SET1;
	__nop();__nop();__nop();__nop();__nop();__nop();

	WS2812B_SET0;
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();__nop();__nop();__nop();
}

/***************************************************************************
 *函  数：void WS2812B_Write1(void)
 *功  能：写1
 *参  数：无
 *返回值：无
 *备  注: 不同的系统时钟频率下需要微调（默认HCLK=100MHz）
 ***************************************************************************/
static void WS2812B_Write1(void)
{
	WS2812B_SET1;
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();__nop();__nop();__nop();

	WS2812B_SET0;
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
}

/***************************************************************************
 *函  数：void WS2812B_WriteByte(uint8_t data)
 *功  能：写一个字节数据
 *参  数：data
 *返回值: 无
 *备  注: 无
 ***************************************************************************/
static void WS2812B_WriteByte(uint8_t byte)
{
	uint8_t i = 0;
	for (i = 0; i < 8; i++)
	{
		if ((byte << i) & 0x80) // 从高位取到低位
			WS2812B_Write1();
		else
			WS2812B_Write0();
	}
}

/***************************************************************************
 *函  数：void WS2812B_SetColour(uint8_t green,uint8_t red,uint8_t blue)
 *功  能：设置一个灯的色彩
 *参  数：green red blue，红绿蓝光所占比例大小,范围0~255
 *返回值: 无
 *备  注: 发送顺序为GRB
 ***************************************************************************/
void WS2812B_SetColour(uint8_t green, uint8_t red, uint8_t blue)
{
	WS2812B_WriteByte(green);
	WS2812B_WriteByte(red);
	WS2812B_WriteByte(blue);
}

/**************************************************************************
 *函  数：void GYRO_Ready(void)
 *功  能：蓝灯闪烁
 *参  数：无
 *返回值：无
 *备  注: 无
 **************************************************************************/
void WS2812B_BlueFlash(void)
{
	WS2812B_Blue();
	Delay_ms(100);
	WS2812B_OFF();
	Delay_ms(100);
	WS2812B_Blue();
	Delay_ms(100);
	WS2812B_OFF();
	Delay_ms(100);
	WS2812B_Blue();
	Delay_ms(100);
	WS2812B_OFF();
}

/**************************************************************************
 *函  数：void WS2812B_Red(void)
 *功  能：红灯
 *参  数：无
 *返回值：无
 *备  注：无
 **************************************************************************/
void WS2812B_Red(void)
{
	WS2812B_SetColour(0, 0xFF, 0);
}

/**************************************************************************
 *函  数：void WS2812B_Orange(void)
 *功  能：橙灯
 *参  数：无
 *返回值：无
 *备  注: 无
 **************************************************************************/
void WS2812B_Orange(void)
{
	WS2812B_SetColour(0xA5, 0xFF, 0x00);
}

/**************************************************************************
 *函  数：void WS2812B_Yellow(void)
 *功  能：黄灯
 *参  数：无
 *返回值：无
 *备  注: 无
 **************************************************************************/
void WS2812B_Yellow(void)
{
	WS2812B_SetColour(0xFF, 0xFF, 0);
}

/**************************************************************************
 *函  数：void WS2812B_Green(void)
 *功  能：绿灯
 *参  数：无
 *返回值：无
 *备  注: 无
 **************************************************************************/
void WS2812B_Green(void)
{
	WS2812B_SetColour(0xFF, 0, 0);
}

/**************************************************************************
 *函  数：void WS2812B_Cyan(void)
 *功  能：青灯
 *参  数：无
 *返回值：无
 *备  注: 无
 **************************************************************************/
void WS2812B_Cyan(void)
{
	WS2812B_SetColour(0xFF, 0, 0xFF);
}

/**************************************************************************
 *函  数：void WS2812B_Blue(void)
 *功  能：蓝灯
 *参  数：无
 *返回值：无
 *备  注: 无
 **************************************************************************/
void WS2812B_Blue(void)
{

	WS2812B_SetColour(0, 0, 0xFF);
}

/**************************************************************************
 *函  数：void WS2812B_Violet(void)
 *功  能：紫灯
 *参  数：无
 *返回值：无
 *备  注: 无
 **************************************************************************/
void WS2812B_Violet(void)
{
	WS2812B_SetColour(0x00, 0xCD, 0xCD);
}

/**************************************************************************
 *函  数：void WS2812B_lWhite(void)
 *功  能：白灯
 *参  数：无
 *返回值：无
 *备  注: 无
 **************************************************************************/
void WS2812B_White(void)
{
	WS2812B_SetColour(0x0F, 0x0F, 0x0F);
}

/**************************************************************************
 *函  数：void WS2812B_OFF(void)
 *功  能：关灯
 *参  数：无
 *返回值：无
 *备  注: 无
 **************************************************************************/
void WS2812B_OFF(void)
{
	WS2812B_SetColour(0, 0, 0);
}
