#include "Delay.h"

/*********************************************************************
*函  数: void Delay_us(uint32_t xus)
*功  能: 微秒级延时
*参  数: xus 延时时长，范围：0~233015
*返回值: 无
*备  注: 无
*********************************************************************/
void Delay_us(uint32_t xus)
{
	SysTick->LOAD = 72 * xus;				//设置定时器重装值
	SysTick->VAL = 0x00;					//清空当前计数值
	SysTick->CTRL = 0x00000005;				//设置时钟源为HCLK，启动定时器
	while(!(SysTick->CTRL & 0x00010000));	//等待计数到0
	SysTick->CTRL = 0x00000004;				//关闭定时器
}

/*********************************************************************
*函  数: void Delay_ms(uint32_t xms)
*功  能: 毫秒级延时
*参  数: xms 延时时长，范围：0~4294967295
*返回值: 无
*备  注: 无
*********************************************************************/
void Delay_ms(uint32_t xms)
{
	while(xms--)
	{
		Delay_us(1000);
	}
}
 
/*********************************************************************
*函  数: void Delay_s(uint32_t s)
*功  能: 秒级延时
*参  数: xs 延时时长，范围：0~4294967295
*返回值: 无
*备  注: 无
*********************************************************************/
void Delay_s(uint32_t xs)
{
	while(xs--)
	{
		Delay_ms(1000);
	}
}
